{"id":1021,"date":"2011-09-24T14:45:26","date_gmt":"2011-09-24T04:45:26","guid":{"rendered":"http:\/\/www.timoradventures.com.au\/?page_id=1021"},"modified":"2015-03-09T18:56:39","modified_gmt":"2015-03-09T07:56:39","slug":"testimonials","status":"publish","type":"page","link":"http:\/\/www.timoradventures.com.au\/about-2\/testimonials\/","title":{"rendered":"Testimonials"},"content":{"rendered":"<p><strong>Trevor: 8 day motorcycle tour: 2014<\/strong><\/p>\n<p>If you want a great holiday experience riding around Timor Leste, I can recommend Timor Adventures. (Trevor even made a video&#8230;check it out)<\/p>\n<p><strong><span style=\"color: black; font-family: 'Calibri','sans-serif';\">&#8220;Trevor Tours Timor 2014&#8221; <\/span><\/strong><span style=\"color: black; font-family: 'Calibri','sans-serif';\"><a id=\"LPlnk769259\" title=\"https:\/\/www.youtube.com\/watch?v=-JsMh8uAC9c&lt;br \/&gt;\nCtrl+Click or tap to follow the link\" href=\"https:\/\/www.youtube.com\/watch?v=-JsMh8uAC9c\">https:\/\/www.youtube.com\/watch?v=-JsMh8uAC9c<\/a><\/span><\/p>\n<p><strong>Mark: 8 day motorcycle tour: May 2014<\/strong><\/p>\n<p>Thanks again for the most AMAZING adventure.  🙂<\/p>\n<p><strong>David: 8 day motorcycle tour: May 2014<\/strong><\/p>\n<p>Thank you for a most memorable, enjoyable and exciting experience. I know it was only eight days but it feels like I saw, ate, smelt and felt so much in such a short time<\/p>\n<p><strong>Liz: custom tour, April 2014<\/strong><\/p>\n<p>I just wanted to let you know that I thoroughly enjoyed the 9 day tour recently completed. I loved the passion and knowledge you have of and for the country, the people and the culture. It was a great introduction and overview for someone like myself, who went with only a cursory knowledge really about the country and culture. I loved it totally. Can&#8217;t wait to join you on another tour soon.<\/p>\n<p><strong>Pip and Barb: Timor 1942 Tour, April 2014<\/strong><\/p>\n<p>Thank you so much from Barb and me for a truly wondrous  never-to-be forgotten experience, made more<br \/>\nmemorable by you two wonderful people. Please say “g’day” to Edu and Alto and our appreciation to them  for a job well done. The Anzac Day service was one that will be treasured and we thank you for that.<\/p>\n<p><strong>Kathleen: Weekend tour to Loi Hunu, March 2014<\/strong><\/p>\n<p>Just letting you know that we all enjoyed a terrific weekend in Loi Hunu. Sanu is a great driver and lovely company. He was very attentive to our needs, carrying bags and filling water bottles etc etc.  We were impressed with the guest house. We managed to fit in swimming, caves walk and cooking class.  So many thanks for setting us up for a lovely weekend<\/p>\n<p><strong>Sean Light up Atauro, <\/strong><strong>July 2013<\/strong><\/p>\n<p>I had a wonderful time on the tour. It was one of the more ‘real’ travel experiences that I have had. I really appreciated the focus the trip had &#8211; learning about the colourful and sometimes very painful history of Timor Leste, but then also seeing first-hand the resilience of the people and visiting some inspiring community development projects. It was everything I had hoped for when I signed up. Anyway, I loved the tour and am very thankful to you both for running such a worthwhile business.<\/p>\n<p><strong>Roz: Light up Baguia, July 2013<\/strong><\/p>\n<p>I have been talking about Timor non stop &amp; have friends already looking at the Timor Adventures page. We still want to come back next year so will be talking with you again about another tour.<\/p>\n<p><strong>Vivienne: Gippsland Business Women&#8217;s tour October 2012 tour<\/strong><\/p>\n<p>Our tour with Shirley was so well organised that we hardly noticed we were being organised!  Every day was a new surprise and a new experience and all interesting &#8211; a wonderful introduction to the diverse history, geography and culture of a remarkable country<\/p>\n<h4>Barb: August 2011, women&#8217;s tour<\/h4>\n<p>“I was fortunate enough to go on the recent women&#8217;s tour of East Timor, run by Timor Adventures. This tour took us to many women&#8217;s groups and co-ops in Dili as well as remote villages all over Timor and sought to provide income for these local groups and enterprises. I met many inspiring and amazing women, saw spectacular coast and country-side, as well as terrible poverty and a country struggling to recover from colonisation, invasion, war and genocide. If you are someone who is looking for a different travel experience &#8211; who would like to support Timorese people rebuilding their communities and lives at the grass-roots and would like to see a beautiful country at the same time, then I urge you to make the effort to go. It will be the experience of a life time!”<\/p>\n<h4>Emma Kate: women&#8217;s tour, August 2011<\/h4>\n<p>Thank you so much Timor Adventures for an amazing journey through the beautiful Timor Leste!!!! We took on the roads, dodged the critters, travelled through some of the most amazing country side I have ever seen and were welcomed everywhere with the biggest smiles and open hearts. It was heard to leave such a wonderful place and I am already planning my next adventure back there. A special thanks to Shirley Carlos and Mana Vana for providing such a well organised and fullfilling safe journey! I&#8217;ll be back for sure&#8230;.<\/p>\n<h4>Brian, July 2011, motorycle tour<\/h4>\n<p>I had a great time on the trip and will remember the times forever<\/p>\n<h4>Susan: July 2010, motorcycle tour<\/h4>\n<p>Riding through Timor Leste has been a highlight of my year. It gave me the chance to see the country in a way not many foreigners get to, and to go where not all foreigners go! Experiencing the landscape, the cheering children on the side of the road, seeing the way in which the East Timorese live and constantly being surprised by the beauty and diversity of the landscape and its people is something I will never forget.<\/p>\n<h4>Stuart: July 2011, motorcycle tour<\/h4>\n<p>Thanks for a damned good outing &#8211; well organised and your enthusiasm for the country was almost contagious<\/p>\n<h4>Margot, September 2011, motorcycle tour<\/h4>\n<p>The country is geographically diverse with spectacular scenery straight from the &#8220;Flinders Ranges &#8220;eucalypt strewn rugged gorges to Bali&#8217;s lush rain forests and rice paddies, a surprise around ever bend. At no time in Timor have I ever felt unsafe, the children are inquisitive, shy but so keen to learn, both the men and women are helpful and friendly communication is a barrier, however I never felt intimidated or unwelcome.<\/p>\n<p>Timor is our poorest neighbour, yet it is culture rich, I found the poverty there far less an emotional challenge than my trip to India.<\/p>\n<h4>Bill:  September 2010, motorcycle tour<\/h4>\n<p>What a trip, riding through country similar to Great Ocean Ride, Grampians (Vic) Blue Mountains(NSW) with the Swiss Alps thrown in for good measure. Riding roads ranging from good ,poor to not there at all added to the excitement of a great 2 weeks. Friendly people in a country frozen in time is a must visit for bikers looking for something different.Congratulations to David and Shirley on a well organised tour and teaching me the skills in dodging chickens, pigs ,water buffalo and the most dangerous of all on the roads the UN workers in 4 wheel drives. Hope to be back for more in a couple of years… Obrigardo Bill<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Trevor: 8 day motorcycle tour: 2014 If you want a great holiday experience riding around Timor Leste, I can recommend Timor Adventures. (Trevor even made a video&#8230;check it out) &#8220;Trevor Tours Timor 2014&#8221; https:\/\/www.youtube.com\/watch?v=-JsMh8uAC9c Mark: 8 day motorcycle tour: May 2014 Thanks again for the most AMAZING adventure.  🙂 David: 8 day motorcycle tour: May 2014 Thank [&hellip;]<\/p>\n","protected":false},"author":4,"featured_media":0,"parent":171,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"ngg_post_thumbnail":0},"_links":{"self":[{"href":"http:\/\/www.timoradventures.com.au\/wp-json\/wp\/v2\/pages\/1021"}],"collection":[{"href":"http:\/\/www.timoradventures.com.au\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"http:\/\/www.timoradventures.com.au\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"http:\/\/www.timoradventures.com.au\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"http:\/\/www.timoradventures.com.au\/wp-json\/wp\/v2\/comments?post=1021"}],"version-history":[{"count":7,"href":"http:\/\/www.timoradventures.com.au\/wp-json\/wp\/v2\/pages\/1021\/revisions"}],"predecessor-version":[{"id":1996,"href":"http:\/\/www.timoradventures.com.au\/wp-json\/wp\/v2\/pages\/1021\/revisions\/1996"}],"up":[{"embeddable":true,"href":"http:\/\/www.timoradventures.com.au\/wp-json\/wp\/v2\/pages\/171"}],"wp:attachment":[{"href":"http:\/\/www.timoradventures.com.au\/wp-json\/wp\/v2\/media?parent=1021"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}