{"id":3354,"date":"2017-10-31T10:02:58","date_gmt":"2017-10-30T23:02:58","guid":{"rendered":"http:\/\/www.timoradventures.com.au\/?page_id=3354"},"modified":"2017-11-08T15:35:29","modified_gmt":"2017-11-08T04:35:29","slug":"visit","status":"publish","type":"page","link":"http:\/\/www.timoradventures.com.au\/visit\/","title":{"rendered":"Visit"},"content":{"rendered":"<h1><span style=\"font-family: verdana, geneva, sans-serif;\">Information for travelers visiting Timor-Leste<\/span><\/h1>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\"><strong>Passport:<\/strong> To travel to Timor-Leste you require a passport that is valid for at least 6 months from the date of your arrival.<\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\"><strong>Visa:<\/strong> A visa on arrival can is purchased at the airport. The cost is $30 USD. Please note that they will not accept any other currency apart from USD and there are no money changing facilities available where you purchase the visa. You may also be asked to show your return ticket.<\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\">There used to be a departure tax but this was removed in mid 2017.<\/span>&nbsp;<\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\"><strong>Currency and money:<\/strong> The currency of Timor-Leste is US dollars (USD). Timor-Leste does have its own coins called Centavos. The denominations are; 100 centavos ($1), 50, 25 (Referred to as a quarter), 10 &amp; 5. <\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\">The ANZ and Mandiri have banks in Dili. There are a number of ATM&#8217;s in Dili but the easiest place to go is Timor Plaza to find an ATM that works. Very few places take credit cards (None outside of Dili) and there are very few ATM&#8217;s outside of Dili. So the message is; get cash and have change for small transactions.<\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\"><strong>Health and insurance:<\/strong> As with any travel it is best to consult your doctor about any necessary vaccinations. There is dengue in Timor-Leste as there is right across Asia and Northern Australia so taking universal precautions against mosquitoes is essential.&nbsp;<\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\">We strongly recommend travel insurance and for our longer tours it is a requirement. We also recommend Australians registering with the Australian Government travel advice site <a href=\"http:\/\/smartraveller.gov.au\">Smartraveller<\/a><\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\"><strong>Phones and internet:<\/strong> There are 3 telecom providers; Timor Telecom, Telemore and Telekomcel. It is MUCH cheaper to use a local sim than overseas roaming. All 3 providers are at Timor Plaza and they can set up your phone. Additional credit can be bought throughout the country. Overall the coverage across Timor-Leste is pretty good. The internet is via a 3G network on your phone or you can purchase an internet USB &#8216;pen&#8217; use on your computer. If you choose to but one go into the telecom provider and have it set up and tested and some &#8216;pens&#8217; do not work with some operating systems.<\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\"><strong>Electricity:<\/strong> Electrical supply across Timor-Leste has improved considerably since 2013 when 2 new power stations were built and a new electricity grid was installed. There is no one standard power point but the most common is the Indonesian style so bring a universal power adapter. Having said that it is best to pack a torch&#8230;just in case!<\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\"><strong>Driving:<\/strong> Cars drive on the left hand side of the road (Same as Indonesia and Australia) however this is a developing country and road rules and driving on the correct side of the road are not always adhered to. Be very, very careful when driving in Timor-Leste especially in the districts where the roads can be very challenging. <\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\">As a tourist a valid licence from your country should be sufficient. Police may pull you over and they will expect to see your licence, current vehicle inspection (Vehicles are inspected each year) as well as the photo page of your passport and visa stamp to verify you are a tourist. If you are unable to carry your passport take a photocopy of the photo page and visa page and put them in your wallet.<\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\"><b>Culture:<\/b>&nbsp;Do ask before taking photos of people, seek permission before visiting sacred sites or communities and wearing modest dress is appreciated especially in the districts<\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\"><strong>Language:<\/strong> Tetum is the local language but many people also speak Bahasa Indonesian. There is a simple <a href=\"http:\/\/translate.tetumdili.com\/\">Tetum to English word translator online here<\/a> or you can download the <a href=\"https:\/\/play.google.com\/store\/apps\/details?id=tl.tetundit.tdt.lexicon&amp;hl=en\">free Tetum-English App from the App Store<\/a><\/span><\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Information for travelers visiting Timor-Leste Passport: To travel to Timor-Leste you require a passport that is valid for at least 6 months from the date of your arrival. Visa: A visa on arrival can is purchased at the airport. The cost is $30 USD. Please note that they will not accept any other currency apart [&hellip;]<\/p>\n","protected":false},"author":4,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"fullpage.php","meta":{"ngg_post_thumbnail":0},"_links":{"self":[{"href":"http:\/\/www.timoradventures.com.au\/wp-json\/wp\/v2\/pages\/3354"}],"collection":[{"href":"http:\/\/www.timoradventures.com.au\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"http:\/\/www.timoradventures.com.au\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"http:\/\/www.timoradventures.com.au\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"http:\/\/www.timoradventures.com.au\/wp-json\/wp\/v2\/comments?post=3354"}],"version-history":[{"count":5,"href":"http:\/\/www.timoradventures.com.au\/wp-json\/wp\/v2\/pages\/3354\/revisions"}],"predecessor-version":[{"id":3382,"href":"http:\/\/www.timoradventures.com.au\/wp-json\/wp\/v2\/pages\/3354\/revisions\/3382"}],"wp:attachment":[{"href":"http:\/\/www.timoradventures.com.au\/wp-json\/wp\/v2\/media?parent=3354"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}