{"id":3494,"date":"2017-12-03T12:45:44","date_gmt":"2017-12-03T01:45:44","guid":{"rendered":"http:\/\/www.timoradventures.com.au\/?page_id=3494"},"modified":"2017-12-03T12:45:44","modified_gmt":"2017-12-03T01:45:44","slug":"terms-and-conditions","status":"publish","type":"page","link":"http:\/\/www.timoradventures.com.au\/terms-and-conditions\/","title":{"rendered":"Terms and conditions"},"content":{"rendered":"<p><span style=\"font-family: verdana, geneva, sans-serif;\"><strong>You must carefully read, acknowledge that you have read, understood and agreed to the following Terms and Conditions, which form part of the contract you enter into about joining one of our Timor Adventure tours. If there is anything which you do not understand, ask for clarification. <\/strong><\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\">1(a)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; This agreement is between Timor Adventures LDA (“the Operator”) and the person\/s named in the attached booking form (“the Participant”). The Participant agrees that this contract is binding upon his or her heirs executors administrators successors and assigns.<\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\">&nbsp;&nbsp; (b)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#8220;We&#8221;, &#8220;us&#8221; and &#8220;our&#8221; in this agreement refer to the Operator. &#8220;You&#8221; and &#8220;your&#8221; refer to the Participant.<\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\"><strong>Price, deposit, and cancellation by Participant<\/strong><\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\">2(a)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The contract price is the total amount shown on the booking form.<\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\">&nbsp; (b)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Acceptance of the booking is not complete until we receive the full contract price. The booking may be cancelled if we do not receive the full amount.<\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\">&nbsp; (c)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; If the booking is cancelled due to non-payment of the full amount of the contract price within the required time we shall be entitled to retain the amount of any deposit.<\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\">&nbsp; (d)&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; If you notify us earlier than 60 days before the commencement of the tour that you wish to cancel your tour you will be entitled to a refund of 50% any amount which you have paid. If you notify us of your cancellation later than 60 days before the commencement of the tour we shall be entitled to retain the whole amount which has been paid. In our absolute discretion we might decide to refund to you more than you are strictly entitled to receive, and in making that decision we shall take into account whether it is possible to obtain a replacement participant for the tour and whether the tour remains viable as a result of the cancellation.<\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\">&nbsp;(e)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The date on which a cancellation is notified to us is the date when that notice is actually received in writing whether by mail or electronically. The onus is on you to ensure that we actually receive notice.<\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\"><strong>Cancellation or price adjustment by Operator<\/strong><\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\">3(a)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We may cancel a tour at any time if, due to terrorism, natural forces or events, political instability, civil unrest or other external events or circumstances it is in our reasonable judgement not viable or not safe to conduct the tour. If a tour is cancelled on this basis, you may choose between applying the amounts which you have paid to us toward an alternative tour or receiving a full refund.&nbsp; That choice is yours to make.<\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\">&nbsp;&nbsp; (b)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We are not responsible for any incidental expenses that you might have incurred as a result of the tour being booked and then cancelled such as visas, vaccinations, non-refundable flights, loss of income, or any other expenses or losses whatsoever.<\/span><\/p>\n<p>&nbsp;<\/p>\n<ol start=\"4\">\n<li><span style=\"font-family: verdana, geneva, sans-serif;\">The contract price is able to be varied if certain circumstances happen which are beyond our control. We reserve the right to amend the contract price up to the date of commencement of the tour in the event of unfavourable changes in exchange rates, increases in transportation costs, increases in local operator costs, taxes, or government action which increases costs. In such instances we will be responsible for the first 2% of the additional costs and you will be responsible for the balance. If any such adjustment results in an increase of more than 10% in the contract price you may cancel the booking within 14 days of notification of that adjustment and obtain a full refund.<\/span><\/li>\n<\/ol>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\"><strong>Inclusions\/exclusions from contract price<\/strong><\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\">5(a)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The contract price does not include:<\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\">(i)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Airfares (Unless specifically included in the price) or other travel costs to or from the location where the tour commences;<\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\">(ii)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Passport or visa charges, departure or similar taxes, excess baggage charges, incidental daily expenditure of a personal nature such as laundry, phone calls etc<\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\">(iii)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Personal travel or medical or public liability insurance<\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\">(iv)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Any tours, travel or incidental activities undertaken by you other than as an official activity comprising part of this tour;<\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\">(v)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Any other matters identified in these Terms or in the Tour Information document relating to this specific tour.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\">5(b)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The contract price includes:<\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\">(i)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Accommodation and other expenses identified in the Tour Information document relating to this specific tour;<\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\">(ii)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The provision of a Tour Leader and vehicle as identified in the Tour Information document relating to this specific tour.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\">5(c)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The tour commences and concludes at the time and place identified in the Tour Information document relating to this specific tour. We are not responsible for any costs arising before the commencement or after the conclusion of the tour, including as a result of flight delays or schedule changes. We are not responsible if you are refused entry to a country because you lack the correct passport, visa or other travel documentation.<\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\"><strong>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;<\/strong><\/span><\/p>\n<p style=\"text-align: left;\"><span style=\"font-family: verdana, geneva, sans-serif;\"><strong>Itinerary variations<\/strong><\/span><\/p>\n<ol start=\"6\">\n<li><span style=\"font-family: verdana, geneva, sans-serif;\">You acknowledge that the nature of this type of tour requires considerable flexibility. The itinerary provided for each tour is representative of the types of activities contemplated, and it will be adhered to so far as it is reasonably practicable to do so. But the route, schedules, itineraries, amenities and mode of transport may be subject to alteration without prior notice due to local circumstances or events. It may become necessary due to weather, local conditions, politics or various other reasons to make changes to tour itineraries. Such changes will be at the sole discretion of the Tour Leader. No refund will be considered in the event of such changes. Please note we are not responsible for any incidental expenses that may be incurred as a result of the change of itinerary such as visas, vaccinations or non-refundable flights.<\/span><\/li>\n<\/ol>\n<p style=\"text-align: left;\"><span style=\"font-family: verdana, geneva, sans-serif;\"><strong>Insurance<\/strong><\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\">7(a)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The tour cost does not include personal travel or medical insurance. Personal travel insurance is compulsory prior to the commencement of the tour. You must provide written proof that you hold travel insurance no later than 2 weeks before the commencement of the trip. If you fail to provide proof you will be unable to join the tour and no refund for the tour costs will be provided<\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\"><strong>Health<\/strong><\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\">8(a)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; You acknowledge that you are aware that a &nbsp;tour on sometimes rough roads in relatively remote areas can be physically challenging. Such a tour can involve risks to life and health which include the conventional risks of being a passanger in a vehicle as well as the particular risks of doing so in rough and or remote areas where access to medical and other services might be limited.&nbsp; You acknowledge that you are responsible for ensuring that you are fit and healthy enough to participate in this tour. We reserve the right to insist on a medical certificate from a doctor stating that you are in a suitable condition to undertake the tour, but we are under no obligation to do so. The responsibility is yours. We recommend that anyone joining this tour should take regular exercise for a period of time before departure. If you suffer from heart, chest, muscular or respiratory disorders, severe asthma or high blood pressure, we strongly advise seeking medical advice before joining this tour.<\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\">&nbsp;&nbsp; (b)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; You agree that should you suffer any serious injury or illness, we are authorised to arrange and consent on your behalf to such urgent medical treatment and\/or emergency evacuation procedures as are deemed reasonably necessary to secure your health and safety. The Tour Leader is delegated the authority to act on our behalf in this respect. The costs of any such medical or evacuation procedures are to be borne by you, and you agree to indemnify us for any expenditure undertaken by us for such purpose.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\"><strong>Authority on tour<\/strong><\/span><\/p>\n<ol start=\"9\">\n<li><span style=\"font-family: verdana, geneva, sans-serif;\">Timor Adventures tours are run by a Tour Leader. The decision of the Tour Leader is final on all matters affecting or likely to affect the itinerary or administrative arrangements for the tour, or the health safety or well-being of any person participating in the tour. If you fail to comply with a decision of this kind made by the Tour Leader, or interfere with the well-being of the group, the Tour Leader may direct that you leave the tour immediately, with no right of refund. You must at all times comply with the laws, customs, foreign exchange and drug regulations of the country being visited, and should travel in accordance with the responsible travel guidelines outlined in the Tour Information document relating to this specific tour.<\/span><\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\"><strong>Acknowledgments and releases<\/strong><\/span><\/p>\n<ol start=\"10\">\n<li><span style=\"font-family: verdana, geneva, sans-serif;\">You:<\/span><\/li>\n<\/ol>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (a)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Warrant that you are over the age of 18 years at the time of executing this document.<\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (b)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Warrant that you know of no matter which has not been brought to our attention&nbsp;&nbsp; which might cause you to be at particular or increased risk to your health or safety or that of others on the tour.<\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (c)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Warrant that you will hold personal travel insurance at the date of commencement of the tour to cover the period and anticipated activities of the tour.<\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (d)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Acknowledge that this is an adventure tour which is to be conducted in a region which has limited infrastructure and support services and where the availability of emergency services might be restricted.<\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (e)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Acknowledge that you are aware that being a passenger in a vehicle on rough or undeveloped or poorly maintained roads, in a region where adherence to road rules by other vehicles may not be assured, and where there may be encountered the unexpected and unpredictable presence on the roads of other vehicles, pedestrians, wildlife and livestock.<\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (f)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Acknowledge that the factors referred to in (d) and (e) carry with them the risk that you might suffer property damage, loss, personal injury or death as a result of your participation in the tour.<\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (g)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Accept all of the risks referred to above as your personal risk.<\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (h)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; To the maximum extent permissible by law release and discharge Timor Adventures LDA and its officers servants and agents from all claims suits demands damages costs and expenses howsoever caused which arise or might in future arise directly or indirectly out of or in connection with your participation on the tour, including where any such claim arises out of the negligence of or breach of obligation express or implied by the Operator or any servant agent or contractor of or employed by the Operator. To the extent that a warranty affecting the Operator, statutory or otherwise, is lawfully able to be excluded from applying to this agreement you agree that it is so excluded. If it is not able to be excluded you agree that the liability of the Operator for breach of such warranty is limited to the provision of a similar tour of equivalent value, or a refund of the total amount paid by you to the Operator in connection with the tour.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\"><strong>Severability and jurisdiction<\/strong><\/span><\/p>\n<ol start=\"11\">\n<li><span style=\"font-family: verdana, geneva, sans-serif;\">If any provision of this agreement is prohibited by law or judged by a court to be unlawful, void or unenforceable, that provision shall, to the extent required, be severed from this agreement and rendered ineffective as far as possible without modifying the remaining provisions of this agreement, and shall not otherwise affect the validity or enforceability of this agreement.<\/span><\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<ol start=\"12\">\n<li><span style=\"font-family: verdana, geneva, sans-serif;\">This agreement is governed by and is to be construed in accordance with the law of Timor-Leste, and the parties submit to the exclusive jurisdiction of the courts of that nation.<\/span><\/li>\n<\/ol>\n","protected":false},"excerpt":{"rendered":"<p>You must carefully read, acknowledge that you have read, understood and agreed to the following Terms and Conditions, which form part of the contract you enter into about joining one of our Timor Adventure tours. If there is anything which you do not understand, ask for clarification. 1(a)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; This agreement is between Timor Adventures LDA [&hellip;]<\/p>\n","protected":false},"author":4,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"fullpage.php","meta":{"ngg_post_thumbnail":0},"_links":{"self":[{"href":"http:\/\/www.timoradventures.com.au\/wp-json\/wp\/v2\/pages\/3494"}],"collection":[{"href":"http:\/\/www.timoradventures.com.au\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"http:\/\/www.timoradventures.com.au\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"http:\/\/www.timoradventures.com.au\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"http:\/\/www.timoradventures.com.au\/wp-json\/wp\/v2\/comments?post=3494"}],"version-history":[{"count":1,"href":"http:\/\/www.timoradventures.com.au\/wp-json\/wp\/v2\/pages\/3494\/revisions"}],"predecessor-version":[{"id":3495,"href":"http:\/\/www.timoradventures.com.au\/wp-json\/wp\/v2\/pages\/3494\/revisions\/3495"}],"wp:attachment":[{"href":"http:\/\/www.timoradventures.com.au\/wp-json\/wp\/v2\/media?parent=3494"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}