{"id":45,"date":"2010-02-19T10:14:05","date_gmt":"2010-02-18T23:14:05","guid":{"rendered":"http:\/\/www.timoradventures.com.au\/?page_id=45"},"modified":"2017-10-18T18:26:40","modified_gmt":"2017-10-18T07:26:40","slug":"east-timor","status":"publish","type":"page","link":"http:\/\/www.timoradventures.com.au\/east-timor\/","title":{"rendered":"Timor-Leste"},"content":{"rendered":"<p><span style=\"font-family: verdana, geneva, sans-serif;\">Timor-Leste, a small half island of 350 kms is truly one of the last untouched destinations on earth. This&nbsp; island abounds with natural beauty in its mountains, beaches and magnificent marine environment. Despite being considered the poorest nation in Asia, it has vast riches in its culture and community.<\/span><br \/>\n<span style=\"font-family: verdana, geneva, sans-serif;\"> Just an hour trip by plane from Darwin, Timor-Leste is easily accessible from Australia.<\/span><\/p>\n<p><span style=\"font-family: verdana, geneva, sans-serif;\">Dili the capital city of Timor-Leste has the sea for its front veranda and is flanked by mountains. Dili holds many interesting attractions, rich with history, markets that showcase the art and craft of the Timorese people and a diverse range of restaurants and bars reflective of the rainbow of nations that have participated in the rebuilding of Timor-Leste.<\/span><br \/>\n<span style=\"font-family: verdana, geneva, sans-serif;\"> Just a short ride out of Dili to the east or west village life takes over. The Timorese are a diverse people, the influences of their Polynesian, Portuguese and Indonesian past are very evident in their spiritual beliefs, handcrafts and buildings. One of the great joys of visiting Timor-Leste is to see first hand the untiring effort of its people to rebuild their country. Community development projects abound with many grass roots examples of advances in health, economic, education and employment opportunities. The traditional respect for the earth, animals, family and ancestors in Timor-Leste is evident in the approach being taken by local communities to this development.<\/span><br \/>\n<span style=\"font-family: verdana, geneva, sans-serif;\"> Tourism is new to Timor-Leste and participants in Timor Adventure tours are privileged to be some of the first few people to experience the traditional village life of this unique country, we aim to tread lightly and help preserve all that is wonderful about this island.<\/span><\/p>\n<div style=\"text-align: center;\">&nbsp;<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Timor-Leste, a small half island of 350 kms is truly one of the last untouched destinations on earth. This&nbsp; island abounds with natural beauty in its mountains, beaches and magnificent marine environment. Despite being considered the poorest nation in Asia, it has vast riches in its culture and community. Just an hour trip by plane [&hellip;]<\/p>\n","protected":false},"author":4,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"ngg_post_thumbnail":0},"_links":{"self":[{"href":"http:\/\/www.timoradventures.com.au\/wp-json\/wp\/v2\/pages\/45"}],"collection":[{"href":"http:\/\/www.timoradventures.com.au\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"http:\/\/www.timoradventures.com.au\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"http:\/\/www.timoradventures.com.au\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"http:\/\/www.timoradventures.com.au\/wp-json\/wp\/v2\/comments?post=45"}],"version-history":[{"count":10,"href":"http:\/\/www.timoradventures.com.au\/wp-json\/wp\/v2\/pages\/45\/revisions"}],"predecessor-version":[{"id":3257,"href":"http:\/\/www.timoradventures.com.au\/wp-json\/wp\/v2\/pages\/45\/revisions\/3257"}],"wp:attachment":[{"href":"http:\/\/www.timoradventures.com.au\/wp-json\/wp\/v2\/media?parent=45"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}